package programmers.n468377;

public class Solution {
    /*
    n개의 스테이지를 순서대로 해결
    - 각 스테이지는 해결 비용존재
    - 힌트권을 많이 사용할수록 비용이 줄어든다.
    - i번 힌트권은 오직 i번 스테이지에서만 가능
    - 한 스테이진에서 최대 n-1개 사용가능
    - 초기에 힌트권 없음
    - 스테이지마다 힌트번들 최대 1개 구매가능,
    - 번들은 이후 스테이지에서 힌트권 제공

    모든 스테이지를 해결하는 최소비용을 구하라.


    힌트권 테이블에 힌트권
    */

    static int n;
    static int k;
    static int min;
    static int[][] cost;
    static int[][] hint;
    public static int solution(int[][] c, int[][] h) {
        min = Integer.MAX_VALUE;
        n = c.length;
        cost = c;
        hint = h;
        k = c[0].length - 1; // 최대 티켓 수

        tickets = new int[n];
        dfs(0, 0);
        return min;
    }
    static int[] tickets;
    static void dfs (int depth, int total) {
        if (depth == n) {
            // calculate
            for (int i = 0; i < n; i++) {
                total += cost[i][Math.min(tickets[i], k)];
            }

            min = Math.min(min, total);
            return;
        }

        dfs(depth + 1, total); // 번들 미구매

        if (depth > 0) {
            // 티켓번들 활성화.
            for (int i = 1; i < hint[0].length; i++) {
                tickets[hint[depth - 1][i] - 1]++;
            }

            dfs(depth + 1, total + hint[depth - 1][0]); // 번들 구매

            // 티켓번들 비활성화
            for (int i = 1; i < hint[0].length; i++)
                tickets[hint[depth - 1][i] - 1]--;
        }
    }

    public static void main(String[] args) {
        // 입출력 예 #1 (정답: 810)
        System.out.println(solution(
                new int[][] {
                        {160, 140, 120, 110, 60},
                        {290, 270, 260, 120, 10},
                        {160, 130, 120, 60, 20},
                        {160, 120, 80, 70, 20},
                        {110, 70, 60, 30, 20}
                },
                new int[][] {
                        {40, 2, 3},
                        {40, 5, 3},
                        {20, 5, 4},
                        {50, 5, 5}
                }
        ));

// 입출력 예 #2 (정답: 1080)
        System.out.println(solution(
                new int[][] {
                        {110, 100, 90, 80, 70, 50, 10},
                        {170, 160, 150, 140, 130, 110, 30},
                        {260, 250, 190, 180, 170, 130, 100},
                        {170, 150, 120, 90, 60, 40, 30},
                        {220, 140, 110, 100, 70, 60, 50},
                        {290, 180, 150, 130, 100, 20, 10},
                        {110, 100, 90, 70, 50, 40, 30}
                },
                new int[][] {
                        {40, 3, 4, 3},
                        {80, 3, 7, 4},
                        {40, 7, 6, 5},
                        {40, 7, 5, 5},
                        {50, 6, 7, 6},
                        {30, 7, 7, 7}
                }
        ));

// 입출력 예 #3 (정답: 1180)
        System.out.println(solution(
                new int[][] {
                        {290, 270, 170, 100, 60, 20},
                        {210, 190, 180, 170, 120, 80},
                        {200, 180, 170, 80, 40, 20},
                        {100, 90, 70, 60, 40, 10},
                        {230, 200, 170, 150, 90, 80},
                        {150, 100, 80, 60, 40, 10}
                },
                new int[][] {
                        {230, 2, 2, 2, 2},
                        {330, 5, 3, 4, 3},
                        {180, 5, 4, 4, 6},
                        {280, 5, 5, 6, 6},
                        {260, 6, 6, 6, 6}
                }
        ));

// 입출력 예 #4 (정답: 267789)
        System.out.println(solution(
                new int[][] {
                        {49250, 42271, 40724, 36310, 32560, 30670, 24100, 10378},
                        {58510, 56101, 54078, 32864, 31443, 19451, 18098, 7187},
                        {68812, 66112, 65024, 60529, 53992, 39865, 31325, 17700},
                        {13768, 12866, 11379, 10425, 6853, 6176, 5655, 2556},
                        {51748, 48647, 41478, 39756, 25302, 18081, 16504, 811},
                        {52690, 34113, 32370, 29555, 19343, 11763, 7566, 5962},
                        {9306, 9190, 8196, 7573, 6275, 4723, 1316, 212},
                        {40713, 40158, 31449, 22349, 20956, 20377, 19489, 14450}
                },
                new int[][] {
                        {0, 2, 4, 6, 2},
                        {0, 6, 3, 3, 4},
                        {0, 6, 4, 5, 5},
                        {0, 7, 5, 8, 7},
                        {0, 7, 7, 7, 7},
                        {0, 7, 7, 7, 8},
                        {0, 8, 8, 8, 8}
                }
        ));

// 입출력 예 #5 (정답: 3004)
        System.out.println(solution(
                new int[][] {
                        {330, 300, 277, 162, 126},
                        {640, 392, 358, 345, 231},
                        {960, 872, 678, 392, 113},
                        {210, 195, 176, 42, 37},
                        {980, 964, 623, 327, 154}
                },
                new int[][] {
                        {976, 2, 2, 3, 5, 3, 3},
                        {746, 3, 3, 3, 3, 4, 3},
                        {319, 5, 4, 4, 4, 4, 4},
                        {966, 5, 5, 5, 5, 5, 5}
                }
        ));

// 입출력 예 #6 (정답: 3426)
        System.out.println(solution(
                new int[][] {
                        {230, 223, 192, 93, 59, 33},
                        {290, 240, 193, 117, 113, 42},
                        {950, 908, 796, 598, 574, 328},
                        {720, 692, 588, 237, 102, 61},
                        {780, 569, 522, 450, 337, 293},
                        {850, 837, 768, 568, 382, 124}
                },
                new int[][] {
                        {158, 2, 2, 3},
                        {260, 5, 4, 3},
                        {268, 4, 4, 4},
                        {426, 5, 5, 6},
                        {330, 6, 6, 6}
                }
        ));
    }

}